In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('Dummy.xlsx',sheet_name='Dummy')

In [3]:
df

     a    b
0   13    4
1   22   23
2   33    5
3   47   47
4   90   91
5   81  100
6   60   77
7   40    2
8   56    5
9   31    3
10   5   10
11  17   14
12   4    8
13   2    7

In [4]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="12345",
  database="dummy_database"
)

In [5]:
from sqlalchemy import create_engine

In [6]:
# Step 2: Create a SQLAlchemy engine to connect to the MySQL database
engine = create_engine("mysql+mysqlconnector://root:12345@localhost/dummy_database")

In [7]:
# Step 3: Convert the Pandas DataFrame to a format for MySQL table insertion
df.to_sql('dummy', con=engine, if_exists='append', index=False)

14

In [8]:
# Create cursor object
cursor = mydb.cursor()

# Execute SELECT query to fetch data from a table
table_name = "dummy"
cursor.execute(f"SELECT * FROM {table_name}")

# Fetch all rows
rows = cursor.fetchall()

# Convert fetched data into a pandas DataFrame
new_df = pd.DataFrame(rows, columns=[desc[0] for desc in cursor.description])

# Process or manipulate DataFrame as needed
print(new_df)

     a    b
0   13    4
1   22   23
2   33    5
3   47   47
4   90   91
5   81  100
6   60   77
7   40    2
8   56    5
9   31    3
10   5   10
11  17   14
12   4    8
13  13    4
14  22   23
15  33    5
16  47   47
17  90   91
18  81  100
19  60   77
20  40    2
21  56    5
22  31    3
23   5   10
24  17   14
25   4    8
26   2    7

In [9]:
new_df

     a    b
0   13    4
1   22   23
2   33    5
3   47   47
4   90   91
5   81  100
6   60   77
7   40    2
8   56    5
9   31    3
10   5   10
11  17   14
12   4    8
13  13    4
14  22   23
15  33    5
16  47   47
17  90   91
18  81  100
19  60   77
20  40    2
21  56    5
22  31    3
23   5   10
24  17   14
25   4    8
26   2    7

In [10]:
new_df = new_df.drop_duplicates()

In [11]:
new_df = new_df.reset_index(drop=True)

In [12]:
new_df

     a    b
0   13    4
1   22   23
2   33    5
3   47   47
4   90   91
5   81  100
6   60   77
7   40    2
8   56    5
9   31    3
10   5   10
11  17   14
12   4    8
13   2    7

In [13]:
delete_query = "DELETE FROM dummy"

# Execute the DELETE statement
cursor.execute(delete_query)

# Commit the changes to the database
mydb.commit()

# Close the cursor and connection
cursor.close()

True

In [14]:
new_df.to_sql('dummy', con=engine, if_exists='replace', index=False)

14